In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
df = pd.read_csv("Train_v2.csv")

In [3]:
df.head()

,country,year,uniqueid,bank_account,location_type,cellphone_access,household_size,age_of_respondent,gender_of_respondent,relationship_with_head,marital_status,education_level,job_type
0,Kenya,2018,uniqueid_1,Yes,Rural,Yes,3,24,Female,Spouse,Married/Living together,Secondary education,Self employed
1,Kenya,2018,uniqueid_2,No,Rural,No,5,70,Female,Head of Household,Widowed,No formal education,Government Dependent
2,Kenya,2018,uniqueid_3,Yes,Urban,Yes,5,26,Male,Other relative,Single/Never Married,Vocational/Specialised training,Self employed
3,Kenya,2018,uniqueid_4,No,Rural,Yes,5,34,Female,Head of Household,Married/Living together,Primary education,Formally employed Private
4,Kenya,2018,uniqueid_5,No,Urban,No,8,26,Male,Child,Single/Never Married,Primary education,Informally employed

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 23524 entries, 0 to 23523
Data columns (total 13 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   country                 23524 non-null  object
 1   year                    23524 non-null  int64
 2   uniqueid                23524 non-null  object
 3   bank_account            23524 non-null  object
 4   location_type           23524 non-null  object
 5   cellphone_access        23524 non-null  object
 6   household_size          23524 non-null  int64
 7   age_of_respondent       23524 non-null  int64
 8   gender_of_respondent    23524 non-null  object
 9   relationship_with_head  23524 non-null  object
 10  marital_status          23524 non-null  object
 11  education_level         23524 non-null  object
 12  job_type                23524 non-null  object
dtypes: int64(3), object(10)
memory usage: 2.3+ MB

In [5]:
df.describe(include= "all")

,country,year,uniqueid,bank_account,location_type,cellphone_access,household_size,age_of_respondent,gender_of_respondent,relationship_with_head,marital_status,education_level,job_type
count,23524,23524.000000,23524,23524,23524,23524,23524.000000,23524.000000,23524,23524,23524,23524,23524
unique,4,NaN,8735,2,2,2,NaN,NaN,2,6,5,6,10
top,Rwanda,NaN,uniqueid_925,No,Rural,Yes,NaN,NaN,Female,Head of Household,Married/Living together,Primary education,Self employed
freq,8735,NaN,4,20212,14343,17454,NaN,NaN,13877,12831,10749,12791,6437
mean,NaN,2016.975939,NaN,NaN,NaN,NaN,3.797483,38.805220,NaN,NaN,NaN,NaN,NaN
std,NaN,0.847371,NaN,NaN,NaN,NaN,2.227613,16.520569,NaN,NaN,NaN,NaN,NaN
min,NaN,2016.000000,NaN,NaN,NaN,NaN,1.000000,16.000000,NaN,NaN,NaN,NaN,NaN
25%,NaN,2016.000000,NaN,NaN,NaN,NaN,2.000000,26.000000,NaN,NaN,NaN,NaN,NaN
50%,NaN,2017.000000,NaN,NaN,NaN,NaN,3.000000,35.000000,NaN,NaN,NaN,NaN,NaN
75%,NaN,2018.000000,NaN,NaN,NaN,NaN,5.000000,49.000000,NaN,NaN,NaN,NaN,NaN
max,NaN,2018.000000,NaN,NaN,NaN,NaN,21.000000,100.000000,NaN,NaN,NaN,NaN,NaN

In [4]:
country_codes,df["country"] = np.unique(df["country"], return_inverse= True)

In [5]:
uniqueid_codes, df["uniqueid"] = np.unique(df["uniqueid"], return_inverse= True)

In [6]:
yes_no = {"No":0,
         "Yes":1}

In [7]:
df["bank_account"]= df["bank_account"].map(yes_no)

In [8]:
df["cellphone_access"]= df["cellphone_access"].map(yes_no)

In [9]:
df["location_type"].unique()

array(['Rural', 'Urban'], dtype=object)

In [10]:
location= {"Rural": 0,
          "Urban": 1}
df["location_type"]= df["location_type"].map(location)

In [11]:
Gender= {"Female": 0,
          "Male": 1}
df["gender_of_respondent"]= df["gender_of_respondent"].map(Gender)

In [12]:
df.head()

,country,year,uniqueid,bank_account,location_type,cellphone_access,household_size,age_of_respondent,gender_of_respondent,relationship_with_head,marital_status,education_level,job_type
0,0,2018,0,1,0,1,3,24,0,Spouse,Married/Living together,Secondary education,Self employed
1,0,2018,1111,0,0,0,5,70,0,Head of Household,Widowed,No formal education,Government Dependent
2,0,2018,2222,1,1,1,5,26,1,Other relative,Single/Never Married,Vocational/Specialised training,Self employed
3,0,2018,3333,0,0,1,5,34,0,Head of Household,Married/Living together,Primary education,Formally employed Private
4,0,2018,4444,0,1,0,8,26,1,Child,Single/Never Married,Primary education,Informally employed

In [13]:
df["relationship_with_head"]= df["relationship_with_head"].astype("category")
relationship_cat = df["relationship_with_head"].values.categories
df["relationship_with_head"]= df["relationship_with_head"].cat.codes.values

In [14]:
from sklearn.preprocessing import LabelEncoder

In [15]:
le = LabelEncoder()

In [16]:
df["marital_status"]= le.fit_transform(df["marital_status"])

In [17]:
marital_cat = le.classes_

In [18]:
df["education_level"]= le.fit_transform(df["education_level"])

In [21]:
marital_status = df["marital_status"].values

In [19]:
education_cat= le.classes_

In [23]:
df["marital_status"]= le.inverse_transform(df["marital_status"])

In [24]:
df["marital_status"] = marital_status

In [20]:
df["job_type"]= le.fit_transform(df["job_type"])
job_cat = le.classes_

In [21]:
df.head()

,country,year,uniqueid,bank_account,location_type,cellphone_access,household_size,age_of_respondent,gender_of_respondent,relationship_with_head,marital_status,education_level,job_type
0,0,2018,0,1,0,1,3,24,0,5,2,3,9
1,0,2018,1111,0,0,0,5,70,0,1,4,0,4
2,0,2018,2222,1,1,1,5,26,1,3,3,5,9
3,0,2018,3333,0,0,1,5,34,0,1,2,2,3
4,0,2018,4444,0,1,0,8,26,1,0,3,2,5

In [22]:
y= np.array(df["bank_account"].values)
X= np.array(df.drop("bank_account", axis=1))

In [23]:
df.shape

(23524, 13)

In [24]:
from sklearn.model_selection import train_test_split, KFold

In [25]:
from sklearn.metrics import accuracy_score

In [26]:
X_train, X_test, Y_train, Y_test = train_test_split(X, y, test_size = 0.2)

In [58]:
X_train.shape

(18819, 12)

In [61]:
folds = KFold(n_splits = 10,
             shuffle = True,
             random_state = 0)
folds.get_n_splits(X_train)

10

In [27]:
from sklearn.tree import DecisionTreeClassifier
from sklearn.svm import SVC
from sklearn.ensemble import RandomForestClassifier
from sklearn.linear_model import LogisticRegression

In [28]:
from sklearn.metrics import accuracy_score, confusion_matrix

# Decision tree Classifier

In [84]:
c = np.arange(2,12)
accuracy = np.zeros((10,10))
i = 0
for train_index, test_index in folds.split(X_train):
    train_X, val_X = X_train[train_index], X_train[test_index]
    train_Y, val_Y = Y_train[train_index], Y_train[test_index]
    j=0
    for x in c:
        dt= DecisionTreeClassifier(
            min_samples_leaf=1,
            max_depth = x)
        dt.fit(train_X, train_Y)
        accuracy[i][j]= dt.score(val_X, val_Y)
        j+=1
        
    i+=1
        
print("The mean accuracy score for the model: ", np.mean(accuracy, axis= 0))
print("Selected model: " ,np.argmax(np.mean(accuracy, axis= 0)))

The mean accuracy score for the model:  [0.8773575  0.88070554 0.8813431  0.88150248 0.881609   0.88187462
 0.87932406 0.87820814 0.87406344 0.86805866]
Selected model:  5

# Support Vector Machine

In [98]:
from sklearn.preprocessing import StandardScaler
import time
scaler = StandardScaler()
c = np.arange(.1, 1.1,.1)
accuracy = np.zeros((10,10))
i = 0
start_time = time.time()
for train_index, test_index in folds.split(X_train):
    train_X, val_X = X_train[train_index], X_train[test_index]
    train_Y, val_Y = Y_train[train_index], Y_train[test_index]
    train_X= scaler.fit_transform(train_X)
    val_X= scaler.fit_transform(val_X)
    j=0
    for x in c:
        supvectmac= SVC(C = x)
        supvectmac.fit(train_X, train_Y)
        y_hat = supvectmac.predict(val_X)
        accuracy[i][j]= accuracy_score(y_hat, val_Y)
        j+=1
        
    i+=1
end_time= time.time()
print("This model took", str(end_time - start_time), "seconds")
print("The mean accuracy score for the model: ", np.mean(accuracy, axis= 0))
print("Selected model: " ,np.argmax(np.mean(accuracy, axis= 0)))

This model took 536.9896903038025 seconds
The mean accuracy score for the model:  [0.87135336 0.87486033 0.87698587 0.87762351 0.87852684 0.87863316
 0.878952   0.87937711 0.87937705 0.87964273]
Selected model:  9

# K Nearest Neighbors

In [101]:
from sklearn.neighbors import KNeighborsClassifier
c = np.arange(2,12)
accuracy = np.zeros((10,10))
start_time = time.time()
i = 0
for train_index, test_index in folds.split(X_train):
    train_X, val_X = X_train[train_index], X_train[test_index]
    train_Y, val_Y = Y_train[train_index], Y_train[test_index]
    j=0
    for x in c:
        knn= KNeighborsClassifier(n_neighbors= x)
        knn.fit(train_X, train_Y)
        accuracy[i][j]= knn.score(val_X, val_Y)
        j+=1
        
    i+=1
end_time= time.time()
print("This model took", str(end_time - start_time), "seconds")       
print("The mean accuracy score for the model: ", np.mean(accuracy, axis= 0))
print("Selected model: " ,np.argmax(np.mean(accuracy, axis= 0)))

This model took 14.081187963485718 seconds
The mean accuracy score for the model:  [0.84903555 0.82762117 0.85397738 0.84547525 0.85674048 0.85296776
 0.85902537 0.85753754 0.85950364 0.85907856]
Selected model:  8

# Logistic Regression

In [103]:
scaler = StandardScaler()
c = np.arange(.1,1.1,.1)
accuracy = np.zeros((10,10))
start_time = time.time()
i = 0
for train_index, test_index in folds.split(X_train):
    train_X, val_X = X_train[train_index], X_train[test_index]
    train_Y, val_Y = Y_train[train_index], Y_train[test_index]
    train_X= scaler.fit_transform(train_X)
    val_X= scaler.fit_transform(val_X)
    j=0
    for x in c:
        lc= LogisticRegression(C= x)
        lc.fit(train_X, train_Y)
        accuracy[i][j]= lc.score(val_X, val_Y)
        j+=1
        
    i+=1
end_time= time.time()
print("This model took", str(end_time - start_time), "seconds")       
print("The mean accuracy score for the model: ", np.mean(accuracy, axis= 0))
print("Selected model: " ,np.argmax(np.mean(accuracy, axis= 0)))

This model took 2.6140172481536865 seconds
The mean accuracy score for the model:  [0.8746479  0.87475417 0.8748073  0.87470103 0.87470103 0.87470103
 0.87475417 0.87475417 0.87475417 0.87475417]
Selected model:  2

# Random Forest

In [107]:
c = np.arange(2,12)
accuracy = np.zeros(10)
start_time = time.time()
i = 0
for x in c:
    RFC= RandomForestClassifier(max_depth= x,
                                min_samples_split = 2,
                                bootstrap = True,
                                random_state = 0,
                               n_jobs= -1)
    RFC.fit(train_X, train_Y)
    accuracy[i]= RFC.score(val_X, val_Y)
    i+=1
    
end_time= time.time()
print("This model took", str(end_time - start_time), "seconds")       
print("The mean accuracy score for the model: ", np.mean(accuracy, axis= 0))
print("Selected model: " ,np.argmax(np.mean(accuracy, axis= 0)))

This model took 5.511154890060425 seconds
The mean accuracy score for the model:  0.8759170653907496
Selected model:  0

# Training the model now with our best model

In [30]:
import time
model = DecisionTreeClassifier(min_samples_leaf = 2,
                              max_depth = 7)

start_time = time.time()
model.fit(X_train, Y_train)
Y_predict = model.predict(X_test)
end_time = time.time()

accuracy = accuracy_score(Y_predict, Y_test)
conf_matrix = confusion_matrix(Y_predict, Y_test)

print("This model took: ", str(end_time-start_time), "seconds")
print("This model accuracy was: ",accuracy)
print("The confusion matrix is: \n", conf_matrix)

This model took:  0.049317359924316406 seconds
This model accuracy was:  0.8805526036131774
The confusion matrix is:
 [[3919  469]
 [  93  224]]

In [48]:
print("Precision: ", conf_matrix[0][0]/(conf_matrix[0][0]+conf_matrix[0][1]))
print("Recall: ", conf_matrix[0][0]/(conf_matrix[0][0]+conf_matrix[1][0]))

Precision:  0.8931175934366454
Recall:  0.9768195413758723

# Loading the test data to be submitted

In [74]:
test_data= pd.read_csv("Test_v2.csv")

In [60]:
test_data.head()

,country,year,uniqueid,location_type,cellphone_access,household_size,age_of_respondent,gender_of_respondent,relationship_with_head,marital_status,education_level,job_type
0,Kenya,2018,uniqueid_6056,Urban,Yes,3,30,Male,Head of Household,Married/Living together,Secondary education,Formally employed Government
1,Kenya,2018,uniqueid_6060,Urban,Yes,7,51,Male,Head of Household,Married/Living together,Vocational/Specialised training,Formally employed Private
2,Kenya,2018,uniqueid_6065,Rural,No,3,77,Female,Parent,Married/Living together,No formal education,Remittance Dependent
3,Kenya,2018,uniqueid_6072,Rural,No,6,39,Female,Head of Household,Married/Living together,Primary education,Remittance Dependent
4,Kenya,2018,uniqueid_6073,Urban,No,3,16,Male,Child,Single/Never Married,Secondary education,Remittance Dependent

In [61]:
test_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10086 entries, 0 to 10085
Data columns (total 12 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   country                 10086 non-null  object
 1   year                    10086 non-null  int64
 2   uniqueid                10086 non-null  object
 3   location_type           10086 non-null  object
 4   cellphone_access        10086 non-null  object
 5   household_size          10086 non-null  int64
 6   age_of_respondent       10086 non-null  int64
 7   gender_of_respondent    10086 non-null  object
 8   relationship_with_head  10086 non-null  object
 9   marital_status          10086 non-null  object
 10  education_level         10086 non-null  object
 11  job_type                10086 non-null  object
dtypes: int64(3), object(9)
memory usage: 945.7+ KB

In [62]:
data_uniqueid = test_data["uniqueid"].values

In [63]:
sample = pd.read_csv("SampleSubmission(1).csv")
sample.head()

            unique_id  bank_account
0  uniqueid_1 x Kenya             0
1  uniqueid_2 x Kenya             0
2  uniqueid_3 x Kenya             0
3  uniqueid_4 x Kenya             0
4  uniqueid_5 x Kenya             0

In [64]:
new_id = []
for i,j in zip(test_data["uniqueid"].values, test_data["country"].values):
    word = i+"x"+j
    new_id.append(word)
    
test_data["uniqueid"] = new_id

In [65]:
test_data.head()

,country,year,uniqueid,location_type,cellphone_access,household_size,age_of_respondent,gender_of_respondent,relationship_with_head,marital_status,education_level,job_type
0,Kenya,2018,uniqueid_6056xKenya,Urban,Yes,3,30,Male,Head of Household,Married/Living together,Secondary education,Formally employed Government
1,Kenya,2018,uniqueid_6060xKenya,Urban,Yes,7,51,Male,Head of Household,Married/Living together,Vocational/Specialised training,Formally employed Private
2,Kenya,2018,uniqueid_6065xKenya,Rural,No,3,77,Female,Parent,Married/Living together,No formal education,Remittance Dependent
3,Kenya,2018,uniqueid_6072xKenya,Rural,No,6,39,Female,Head of Household,Married/Living together,Primary education,Remittance Dependent
4,Kenya,2018,uniqueid_6073xKenya,Urban,No,3,16,Male,Child,Single/Never Married,Secondary education,Remittance Dependent

# Data Prepocessing

This procedure is to convert the cateorical data to numerables that the computer can work with

In [66]:
yes_no = {"No":0,
         "Yes":1}
location= {"Rural": 0,
          "Urban": 1}
Gender= {"Female": 0,
          "Male": 1}
le = LabelEncoder()
country_codes,test_data["country"] = np.unique(test_data["country"], return_inverse= True)
uniqueid_codes, test_data["uniqueid"] = np.unique(test_data["uniqueid"], return_inverse= True)
test_data["cellphone_access"]= test_data["cellphone_access"].map(yes_no)
test_data["location_type"]= test_data["location_type"].map(location)
test_data["gender_of_respondent"]= test_data["gender_of_respondent"].map(Gender)
test_data["relationship_with_head"]= test_data["relationship_with_head"].astype("category")
relationship_cat = test_data["relationship_with_head"].values.categories
test_data["relationship_with_head"]= test_data["relationship_with_head"].cat.codes.values
test_data["marital_status"]= le.fit_transform(test_data["marital_status"])
test_data["education_level"]= le.fit_transform(test_data["education_level"])
test_data["job_type"]= le.fit_transform(test_data["job_type"])

In [67]:
data = np.array(test_data)

In [68]:
pred = model.predict(data)

In [69]:
Banked_unbanked_sub = pd.DataFrame()

In [70]:
Banked_unbanked_sub["uniqueid"]= new_id
Banked_unbanked_sub["bank_account"] = pred

In [71]:
Banked_unbanked_sub.head()

              uniqueid  bank_account
0  uniqueid_6056xKenya             1
1  uniqueid_6060xKenya             1
2  uniqueid_6065xKenya             0
3  uniqueid_6072xKenya             0
4  uniqueid_6073xKenya             0

In [72]:
Banked_unbanked_sub.to_csv("SubmissionZ1.csv")

In [55]:
"uniqueid_6722 x Kenya" in new_id

True

In [57]:
Banked_unbanked_sub.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10086 entries, 0 to 10085
Data columns (total 2 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   uniqueid      10086 non-null  object
 1   bank_account  10086 non-null  int64
dtypes: int64(1), object(1)
memory usage: 157.7+ KB

In [77]:
submission_df = pd.DataFrame({"uniqueid":test_data["uniqueid"]+" x "+test_data["country"],
                             "bank_account": pred})

In [78]:
submission_df.head()

                uniqueid  bank_account
0  uniqueid_6056 x Kenya             1
1  uniqueid_6060 x Kenya             1
2  uniqueid_6065 x Kenya             0
3  uniqueid_6072 x Kenya             0
4  uniqueid_6073 x Kenya             0

In [79]:
submission_df.to_csv("SubmissionZ1.csv")

In [81]:
"uniqueid_7867 x Kenya" in submission_df["uniqueid"]

False

In [82]:
"uniqueid_6722 x Kenya" in submission_df["uniqueid"]

False

In [84]:
submission_df["uniqueid"].values

array(['uniqueid_6056 x Kenya', 'uniqueid_6060 x Kenya',
       'uniqueid_6065 x Kenya', ..., 'uniqueid_3000 x Uganda',
       'uniqueid_3001 x Uganda', 'uniqueid_3002 x Uganda'], dtype=object)

In [85]:
"uniqueid_6722" in test_data["uniqueid"]

False

In [86]:
"uniqueid_6714" in test_data["uniqueid"]

False